<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 7 changes.</summary>

```diff
# tailscale_tailnet_key.tailscale_key has been deleted
+ tailscale_tailnet_key.tailscale_key will be created
! module.ubuntu22.proxmox_virtual_environment_vm.vm will be updated in-place
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be replaced due to changes in replace_triggered_by
! module.vm_minimal_config.terraform_data.combined_ci_hash will be updated in-place
! module.vm_minimal_config.terraform_data.creation_date will be replaced due to changes in replace_triggered_by
! module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] must be replaced
! module.vm_minimal_config.module.cloud_init_files[0].random_id.random_id must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 2 to change, 4 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-15T04:16:35Z [(view log)](https://github.com/perchnet/p/actions/runs/16982805518/job/48146132032#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # tailscale_tailnet_key.tailscale_key has been deleted
  - resource "tailscale_tailnet_key" "tailscale_key" {
        id            = "kQqzr2pHKR11CNTRL"
      - key           = (sensitive value) -> null
        tags          = [
            "tag:web-ingress",
        ]
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (29 unchanged attributes hidden)

      ~ disk {
          ~ size              = 20 -> 8
            # (14 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be replaced due to changes in replace_triggered_by
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ description             = "Terraform VM created on 2025-08-15T03:59:44Z" -> (known after apply)
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:38:E9:D2",
        ] -> (known after apply)
        name                    = "vm-ubuntu22-minimal"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (sensitive value)
          + network_data_file_id = (sensitive value)
          ~ user_data_file_id    = (sensitive value) # forces replacement
          + vendor_data_file_id  = (sensitive value)
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:38:E9:D2" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.terraform_data.combined_ci_hash will be updated in-place
  ~ resource "terraform_data" "combined_ci_hash" {
        id     = "5b2a8efd-c574-64c5-576f-a072826271ae"
      ~ input  = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ hash = (sensitive value)
        }
      ~ output = {
          - hash = "295d29"
        } -> (known after apply)
    }

  # module.vm_minimal_config.terraform_data.creation_date will be replaced due to changes in replace_triggered_by
-/+ resource "terraform_data" "creation_date" {
      ~ id     = "7ac405c1-7432-63f9-386e-c1383c62265e" -> (known after apply)
      ~ input  = {
          ~ timestamp = "2025-08-15T03:59:44Z" -> (known after apply)
        }
      ~ output = {
          - timestamp = "2025-08-15T03:59:44Z"
        } -> (known after apply)
    }

  # module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] must be replaced
-/+ resource "proxmox_virtual_environment_file" "ci_user_data" {
      + file_modification_date = (known after apply)
      ~ file_name              = "2faa4942f56fcaae.user-data.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/2faa4942f56fcaae.user-data.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "2faa4942f56fcaae.user-data.yaml" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.vm_minimal_config.module.cloud_init_files[0].random_id.random_id must be replaced
-/+ resource "random_id" "random_id" {
      ~ b64_std     = "L6pJQvVvyq4=" -> (known after apply)
      ~ b64_url     = "L6pJQvVvyq4" -> (known after apply)
      ~ dec         = "3434638217757837998" -> (known after apply)
      ~ hex         = "2faa4942f56fcaae" -> (known after apply)
      ~ id          = "L6pJQvVvyq4" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "combined_ci_hash"                    = "295d29" -> (known after apply)
          ~ "short_ci_user_data_contents_hash"    = "Ts3GLL" -> (known after apply)
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 2 to change, 4 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-56-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->